xercise 15:
Group data by region and category.


Calculate total sales and average order value.


Sort regions by total revenue.

In [1]:
data = {
    'Region': ['East', 'East', 'West', 'West', 'East', 'West', 'East', 'West'],
    'Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing', 'Electronics', 'Clothing', 'Clothing', 'Electronics'],
    'Sales': [100, 50, 120, 80, 150, 70, 60, 110],
    'OrderID': [1, 2, 3, 4, 5, 6, 7, 8]
}

In [3]:
import pandas as pd
df= pd.DataFrame(data)

In [4]:
df

  Region     Category  Sales  OrderID
0   East  Electronics    100        1
1   East     Clothing     50        2
2   West  Electronics    120        3
3   West     Clothing     80        4
4   East  Electronics    150        5
5   West     Clothing     70        6
6   East     Clothing     60        7
7   West  Electronics    110        8

In [8]:
cal=df.groupby(['Region','Category'])['Sales'].agg(['sum','mean'])

In [9]:
cal

                    sum   mean
Region Category
East   Clothing     110   55.0
       Electronics  250  125.0
West   Clothing     150   75.0
       Electronics  230  115.0

In [12]:
cal.rename(columns={'sum' :"Total sales" , "mean" : "AVG order_value"})

                    Total sales  AVG order_value
Region Category
East   Clothing             110             55.0
       Electronics          250            125.0
West   Clothing             150             75.0
       Electronics          230            115.0

In [27]:
tr =df.groupby('Region')['Sales'].sum().reset_index()

In [29]:
c=tr.sort_values(by='Sales',ascending=False)

In [31]:
c.reset_index()

   index Region  Sales
0      1   West    380
1      0   East    360